In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
npn = np.nan
ser1 = Series([2, npn, 4, npn, 6, npn], 
              index=['Q','R','S','T','U','V'])

ser2 = Series(np.arange(len(ser1), dtype = np.float64), 
             index = ['Q','R','S','T','U','V'])

ser2[-1] = npn

In [13]:
ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [14]:
ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    NaN
dtype: float64

In [22]:
# We create a series where the value of the ser1 is chosen if 
# ser2 is NaN, otherwise choose ser1
Series(np.where(pd.isnull(ser1), ser2,ser1))

0    2.0
1    1.0
2    4.0
3    3.0
4    6.0
5    NaN
dtype: float64

In [18]:
# Chooses the values of the first Series unless its NaN
# Works the same as the np.where condition above
ser1.combine_first(ser2)

Q    False
R    False
S    False
T    False
U    False
V     True
dtype: bool

In [24]:
dframe_odds = DataFrame({'X':[1., npn, 3., npn],
                        'Y':[npn,5.,npn,7.],
                        'Z':[npn,9.,npn,11.]})

dframe_evens = DataFrame({'X':[2.,4.,npn,6.,8.],
                         'Y':[npn,10.,12.,14.,16.]})

In [25]:
dframe_odds

     X    Y     Z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [26]:
dframe_evens

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [27]:
dframe_odds.combine_first(dframe_evens)

     X     Y     Z
0  1.0   NaN   NaN
1  4.0   5.0   9.0
2  3.0  12.0   NaN
3  6.0   7.0  11.0
4  8.0  16.0   NaN